package main

import (
    "fmt"
    "log"
    "net/http"
)

// Обработчик HTTP-запросов
func handler(w http.ResponseWriter, r *http.Request) {
    // В ответ добавим уникальный идентификатор для простоты отслеживания изменений
    message := "Привет от Go-приложения (версия 1.0)! Я успешно развернут на GCP! 🚀"
    fmt.Fprintf(w, message)
    log.Printf("Запрос обработан.")
}

func main() {
    http.HandleFunc("/", handler)
    port := "8080"
    log.Printf("Сервер запущен и слушает на порту :%s", port)
    
    // Запускаем HTTP-сервер
    if err := http.ListenAndServe(":"+port, nil); err != nil {
        log.Fatalf("Ошибка при запуске сервера: %v", err)
    }
}